# 3) Искусственный интеллект Антон, созданный Гилфойлом, взломал сеть умных холодильников. 
# Теперь он использует их в качестве серверов "Пегого дудочника". 
# Помогите владельцу фирмы отыскать все зараженные холодильники.
# Для каждого холодильника существует строка с данными, состоящая из строчных букв и цифр,
# и если в ней присутствует слово "anton" 
# (необязательно рядом стоящие буквы, главное наличие последовательности букв), 
# то холодильник заражен и нужно вывести номер холодильника, нумерация начинается с единицы
# 
# Формат входных данных
# В первой строке подаётся число n – количество холодильников. В последующих 
# n строках вводятся строки, содержащие латинские строчные буквы и цифры, 
# в каждой строке от 5 до 100 Cимволов.

# Формат выходных данных
# Программа должна вывести номера зараженных холодильников через пробел. 
# Если таких холодильников нет, ничего выводить не нужно.

# Формат выходных данных
# Программа должна вывести номера зараженных холодильников через пробел. 
# Если таких холодильников нет, ничего выводить не нужно.


# Sample Input 1:
# 6
# 222anton456
# a1n1t1o1n1
# 0000a0000n00t00000o000000n
# gylfole
# richard
# ant0n
# Sample Output 1:
# 1 2 3

n = int(input('введите количество строк '))
list = []
m = {'a','n','t','o','n'}
for i in range(n):
    list.append(input())
for i in range(n):
    # if len(set(list[i]).intersection(m)) == 4:
    if 'a' in list[i] and 't' in list[i] and 'o' in list[i] and list[i].count('n') >= 2:
        print(i,end=" ")



exit()
n = int(input())
list1 = []
for i in range(n):
    a = input()
    if 'a' in a:
        a = a[a.find('a'):]
        if 'n' in a:
            a = a[a.find('n'):]
            if 't' in a:
                a = a[a.find('t'):]
                if 'o' in a:
                    a = a[a.find('o'):]
                    if 'n' in a:
                        list1.append(i + 1)                   
print(*list1)
