# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.

str1 = input('введите предложение ')
str2 = input('введите слово ')
print(str1.count(str2))